diplom-src/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>ВКМ_Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Специалист</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ВыполненныеРаботы</name>
    <attributes>
      <name>ВКМ_ОписаниеРабот</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/Documents/ВКМ_ОбслуживаниеКлиента/Forms/ВКМ_ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы




&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	РезультатПроверки = ПроверкаДокументаНаИзменение(ТекущийОбъект.Ссылка, ПараметрыЗаписи.ДатаПроведенияРабот, ПараметрыЗаписи.ВремяНачалаРабот, ПараметрыЗаписи.ВремяОкончанияРабот, ПараметрыЗаписи.Специалист);
	ТекстСообщения = СформироватьТекстСообщенияТелеграм(РезультатПроверки);
	Если ТекстСообщения <> Неопределено Тогда
		СоздатьЗаписьВСправочникСообщенияТелеграм(ТекстСообщения);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Ссылка,"ВКМ_ДатаПроведенияРабот, ВКМ_ВремяНачалаРабот, ВКМ_ВремяОкончанияРабот, ВКМ_Специалист");
	ПараметрыЗаписи.Вставить("ДатаПроведенияРабот", ЗначенияРеквизитов.ВКМ_ДатаПроведенияРабот);
	ПараметрыЗаписи.Вставить("ВремяНачалаРабот", ЗначенияРеквизитов.ВКМ_ВремяНачалаРабот);
	ПараметрыЗаписи.Вставить("ВремяОкончанияРабот", ЗначенияРеквизитов.ВКМ_ВремяОкончанияРабот);
	ПараметрыЗаписи.Вставить("Специалист", ЗначенияРеквизитов.ВКМ_Специалист);

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура СоздатьЗаписьВСправочникСообщенияТелеграм(Текст);
	НовыйЭлемент = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
	НовыйЭлемент.ВКМ_ТекстСообщения = Текст;
	НовыйЭлемент.Записать();
	
	ВКМ_ТелеграмКлиентСервер.ОтправкаСообщенияВТелеграм(Текст);
КонецПроцедуры

#КонецОбласти

Функция ПроверкаДокументаНаИзменение(Ссылка, Дата, ВремяНачалаРабот, ВремяОкончанияРабот, Специалист);
	РезультатПроверки = Новый Структура;
	РезультатПроверки.Вставить("ПроверяемыйДокумент",Ссылка);
	РезультатПроверки.Вставить("Проведен",Ссылка.Проведен);
	Если Дата <> Ссылка.ВКМ_ДатаПроведенияРабот Тогда
		РезультатПроверки.Вставить("ИзменениеДаты", Формат(Ссылка.ВКМ_ДатаПроведенияРабот, "ДЛФ=DD"));
	Иначе РезультатПроверки.Вставить("ИзменениеДаты", 0);
	КонецЕсли;
	Если ВремяНачалаРабот <> Ссылка.ВКМ_ВремяНачалаРабот Тогда
		РезультатПроверки.Вставить("ИзменениеВремениНачалаРабот", Формат(Ссылка.ВКМ_ВремяНачалаРабот, "ДЛФ=T"));
	Иначе РезультатПроверки.Вставить("ИзменениеВремениНачалаРабот", 0);
	КонецЕсли;
	Если ВремяОкончанияРабот <> Ссылка.ВКМ_ВремяОкончанияРабот Тогда
		РезультатПроверки.Вставить("ИзменениеВремениОкончанияРабот", Формат(Ссылка.ВКМ_ВремяОкончанияРабот, "ДЛФ=T"));
	Иначе РезультатПроверки.Вставить("ИзменениеВремениОкончанияРабот", 0);
	КонецЕсли;
	Если Специалист <> Ссылка.ВКМ_Специалист Тогда
		РезультатПроверки.Вставить("ИзменениеСпециалиста", Ссылка.ВКМ_Специалист);
	Иначе РезультатПроверки.Вставить("ИзменениеСпециалиста", 0);
	КонецЕсли;
	Возврат РезультатПроверки;
КонецФункции

Функция СформироватьТекстСообщенияТелеграм(РезультатПроверки);
	Если НЕ РезультатПроверки.Проведен Тогда
		Текст = "Создан новый документ № " + РезультатПроверки.ПроверяемыйДокумент.Номер + ". 
		|Дата проведения работ: " + Объект.Дата + ". 
		|Клиент: " + Объект.ВКМ_Клиент + ".";
	ИначеЕсли РезультатПроверки.ИзменениеВремениНачалаРабот = 0 И РезультатПроверки.ИзменениеВремениОкончанияРабот = 0 И 
	РезультатПроверки.ИзменениеДаты = 0 И РезультатПроверки.ИзменениеСпециалиста = 0 Тогда
		Текст = Неопределено;
	Иначе
		Текст = "В документе № " + РезультатПроверки.ПроверяемыйДокумент.Номер;
			Если РезультатПроверки.ИзменениеДаты <> 0 Тогда
				Текст = Текст + ". 
				|Изменена Дата проведения работ. Новое значение: " + РезультатПроверки.ИзменениеДаты + ".";
			КонецЕсли;
			Если РезультатПроверки.ИзменениеСпециалиста <> 0 Тогда
				Текст = Текст + ". 
				|Изменен Специалист. Новое значение: " + РезультатПроверки.ИзменениеСпециалиста + ".";
			КонецЕсли;
			Если РезультатПроверки.ИзменениеВремениНачалаРабот <> 0 Тогда
				Текст = Текст + ". 
				|Изменено Время начала работ. Новое значение: " + РезультатПроверки.ИзменениеВремениНачалаРабот + ".";
			КонецЕсли;
			Если РезультатПроверки.ИзменениеВремениОкончанияРабот <> 0 Тогда
				Текст = Текст + ". 
				|Изменено Время окончания работ. Новое значение: " + РезультатПроверки.ИзменениеВремениОкончанияРабот + ".";
			КонецЕсли;
	КонецЕсли;
	Возврат Текст;
КонецФункции
